{
    "drinks": [
      {
        "name": "Starry Drip",
        "recipe": "Nocturnal Drip + Stardust",
        "description": "A deep, velvety black coffee speckled with glistening stardust, mimicking the endless night sky in a single cup."
      },
      {
        "name": "Ember Awakening",
        "recipe": "Infernal Roast + Honey",
        "description": "A fiery coffee tempered by ethereal honey, balancing bold spice with a golden smoothness that stirs the senses."
      },
      {
        "name": "Midnight Frost",
        "recipe": "Nocturnal Drip + Cloud Foam",
        "description": "A bold, extra-strong midnight roast topped with airy foam, lightening the depth of its intensity with a soft finish."
      },
      {
        "name": "Sunfire Espresso",
        "recipe": "Infernal Roast + Stardust",
        "description": "A fiery roast kissed with cosmic sweetness, igniting a surge of warmth while leaving behind a radiant glow."
      },
      {
        "name": "Eclipsed Mocha",
        "recipe": "Cocoa + Whisper Syrup",
        "description": "A ghostly chocolate blend with a subtle, haunting sweetness that lingers like a half-forgotten lullaby."
      },
      {
        "name": "Celestial Cocoa",
        "recipe": "Cocoa + Stardust",
        "description": "A silky chocolate drink infused with twinkling sweetness, bringing comfort and warmth to wandering souls."
      },
      {
        "name": "Twilight Velvet",
        "recipe": "Ghost brew + Whisper Syrup",
        "description": "A smooth, subtly sweet cold brew that lingers on the tongue like a fading memory, perfect for ghosts seeking quiet reflection."
      },
      {
        "name": "Dreamcatcher",
        "recipe": "Ghost brew + Stardust",
        "description": "A shimmering cold brew with a delicate, starry sweetness that helps spirits recall distant, cherished dreams."
      },
      {
        "name": "Lunar Bloom",
        "recipe": "Moonlit Tea + Cloud Foam",
        "description": "A light, floral tea crowned with airy foam, reminiscent of soft moonbeams resting on drifting clouds."
      },
      {
        "name": "Moonlit Comfort",
        "recipe": "Moonlit Tea + Whisper Syrup",
        "description": "A softly glowing herbal tea with a whisper of sweetness, easing restless spirits into peaceful slumber."
      }
    ]
  }
  