{
    "levels": [
        {
            "level": 1,
            "customer": {
                "name": "Somber Spirit",
                "description": "A melancholic ghost who has wandered for ages, longing for warmth and solace. They seek a drink to lift their weary soul."
            },
            "drinks": ["Celestial Cocoa"]
        },
        {
            "level": 2,
            "customer": {
                "name": "Lost Spirit",
                "description": "A restless soul burdened by regret. They need something soothing to help them move on."
            },
            "drinks": ["Twilight Velvet"]
        },
        {
            "level": 3,
            "customer": {
                "name": "Wandering Spirit",
                "description": "A ghost lost in time, seeking the comfort of stars to remind them of their past."
            },
            "drinks": ["Dreamcatcher"]
        },
        {
            "level": 4,
            "customer": {
                "name": "Shadowed Specter",
                "description": "A ghost shrouded in darkness, struggling to see the light. They crave something bold to break through the fog."
            },
            "drinks": ["Midnight Frost"]
        },
        {
            "level": 5,
            "customer": {
                "name": "Lonely Ghost",
                "description": "A spirit adrift, separated from those they loved. They seek peace and comfort in a gentle drink."
            },
            "drinks": ["Moonlit Comfort"]
        },
        {
            "level": 6,
            "customer": {
                "name": "Eternal Wanderer",
                "description": "A spirit caught in a never-ending journey, desperate to feel alive again. They need something sweet and revitalizing."
            },
            "drinks": ["Eclipsed Mocha"]
        },
        {
            "level": 7,
            "customer": {
                "name": "Faded Spirit",
                "description": "A ghost who feels disconnected from the world, longing to feel the warmth of life once more."
            },
            "drinks": ["Sunfire Espresso"]
        },
        {
            "level": 8,
            "customer": {
                "name": "Eclipsed Soul",
                "description": "A soul weary from the weight of endless time, seeking a gentle and restful drink to ease their burden."
            },
            "drinks": ["Lunar Bloom"]
        },
        {
            "level": 9,
            "customer": {
                "name": "Eternal Wraith",
                "description": "A wraith who has been waiting for someone, trapped in time. They seek a drink that will bring peace and connection."
            },
            "drinks": ["Starry Drip"]
        },
        {
            "level": 10,
            "customer": {
                "name": "Rhythm Stage",
                "description": "You found a glitch."
            },
            "drinks": ["N/A"]
        }, 
        {
            "level": 11,
            "customer": {
            "name": "Eternal Wraith",
            "description": "A spirit who lingers in forgotten places, drawn to the faint warmth of old comforts. They seek something that feels like returning to a place they once called home."
            },
            "drinks": ["Ember's Hollow"]
        },
        {
            "level": 12,
            "customer": {
            "name": "Moonlit Specter",
            "description": "They wander beneath clouded skies, weighed by echoes of the past. In their hands, they hope to hold a drink that helps them face what still lingers in the dark."
            },
            "drinks": ["Obsidian Reign"]
        },
        {
            "level": 13,
            "customer": {
            "name": "Glimmering Shade",
            "description": "They drift along forgotten paths, clinging to faint glimmers of possibility. Something inside them yearns for a sign that it's not too late to begin again."
            },
            "drinks": ["Abyssal Bloom"]
        },
        {
            "level": 14,
            "customer": {
            "name": "Faded Echo",
            "description": "Memories come and go like fog on glass—sharp one moment, then gone the next. They want something that will soften the weight of what's been lost."
            },
            "drinks": ["Crimson Haze"]
        },
        {
            "level": 15,
            "customer": {
            "name": "Silent Repose",
            "description": "They sit at the edge of endings and beginnings, where stillness hums like a lullaby. They need something quiet to settle the ache of waiting."
            },
            "drinks": ["Dawn's Lament", "EclipseVeil", "Mistbound"]
        },
        {
            "level": 16,
            "customer": {
            "name": "Luminous Wanderer",
            "description": "Glowing faintly in the gloom, they search for something to affirm their journey. They crave a spark to remind them they are here, and they matter."
            },
            "drinks": ["Radiance"]
        },
        {
            "level": 17,
            "customer": {
            "name": "Veiled Shadow",
            "description": "They carry burdens they no longer fully understand. What they seek is a change—subtle, gentle—that lets them see old wounds in a new light."
            },
            "drinks": ["The Shifting"]
        },
        {
            "level": 18,
            "customer": {
            "name": "Shrouded One",
            "description": "They speak little, their presence like a whisper in heavy fog. They’re drawn to things that feel like being seen without having to be found."
            },
            "drinks": ["Faded Silence"]
        },
        {
            "level": 19,
            "customer": {
            "name": "Wandering Soul",
            "description": "Their mind flits from thought to thought like wind through dry leaves. What they long for is something that helps them settle into themselves again."
            },
            "drinks": ["Mistbound", "The Shifting", "Crimson Haze"]
        }
    ]
}
